---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.TitleblockBadViewType
source: html/e881fe67-4b31-528c-1d10-19632982dc22.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.TitleblockBadViewType Property

Titleblocks can only be placed on sheets.

## Syntax (C#)
```csharp
public static FailureDefinitionId TitleblockBadViewType { get; }
```